Repository: wynant-dev/swiftPokedex
Catalog: SwiftPokedex/Resources/Localizable.xcstrings
Source language: en
Languages: de, fr

# error.context.generation_data
source: generation data
de: Generationsdaten
fr: données des générations

# error.context.pokemon_data
source: Pokémon data
de: Pokémon-Daten
fr: données Pokémon

# error.decoding_failed
source: Could not read %@.
de: %@ konnte nicht gelesen werden.
fr: Impossible de lire %@.

# error.http
source: Server error (%lld).
de: Serverfehler (%lld).
fr: Erreur serveur (%lld).

# error.invalid_request
source: Invalid request.
de: Ungültige Anfrage.
fr: Requête invalide.

# generations.count
source: %lld generations
de: %lld Generationen
fr: %lld générations

# generations.load_failed.title
source: Could not load generations
de: Generationen konnten nicht geladen werden
fr: Impossible de charger les générations

# generations.retry
source: Retry
de: Erneut versuchen
fr: Réessayer

# generations.title
source: Generations
de: Generationen
fr: Générations

# pokemon_detail.fetch
source: Fetch
de: Laden
fr: Charger

# pokemon_detail.height
source: Height: %@
de: Größe: %@
fr: Taille : %@

# pokemon_detail.id_label
source: No. %@
de: Nr. %@
fr: N° %@

# pokemon_detail.name_placeholder
source: Pokémon name
fr: Nom du Pokémon
